ТОИР_демо/src/InformationRegisters/торо_МатрицаПереходаСтатусовДокументов/торо_МатрицаПереходаСтатусовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МатрицаПереходаСтатусовДокументов</name>
  <resources>
    <name>Начальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщенияЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПодборах</name>
    <comment>Не выводить ремонтные работы в форме подбора для документов, имеющих соответствующий статус</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СледующийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВыполняемыеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>AccumulationRegister.торо_ЗапланированныеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_НарядыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовНарядовНаРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявок</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаводскойНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеПредписания</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзДокументаОснования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подрядчики</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>EnumRef.торо_ОтветственныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/CommonModules/торо_ЗаявкаНаРемонт/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_ЗаявкаНаРемонт: методы, для работы с документом "Смета ремонта (заявка на ремонтные работы).
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет заполнение типовых затрат технологических операций.
//
// Параметры:
//  ДокументОбъект  – ДокументОбъект.торо_ЗаявкаНаРемонт – документ для которого
//                    необходимо заполнить типовые затраты.
//  СтрокаДерева    – СтрокаДереваЗначений – строка дерева ремонтных работ для
//                    которой заполняются типовые затраты.
//
Процедура ЗаполнитьТиповыеЗатратыТехнологическойОперации(РемонтныеРаботы, Объект, СтруктураСтрокаРодитель, Значение, РемонтыОборудования_ID = "") Экспорт
	
	
	СтрокаДерева = РемонтныеРаботы.Добавить();
	СтрокаДерева.ID                     = Новый УникальныйИдентификатор;
	СтрокаДерева.Родитель_ID            = СтруктураСтрокаРодитель.СтрокаРодитель_ID;
	СтрокаДерева.РемонтнаяРабота        = Значение;
	СтрокаДерева.Картинка               = торо_Ремонты.ИндексКартинкиДереваРемонтныхРабот(Значение);
	СтрокаДерева.Количество             = 1;
	СтрокаДерева.РемонтыОборудования_ID = ?(РемонтыОборудования_ID = "", СтруктураСтрокаРодитель.СтрокаРодительРемонтыОборудования_ID,РемонтыОборудования_ID);
	
	
	СтруктураСоответствияТЧ = Новый Структура;
	СтруктураСоответствияТЧ.Вставить("МатериальныеЗатраты", "МатериальныеЗатраты");
	СтруктураСоответствияТЧ.Вставить("ТрудовыеЗатраты"    , "ТрудовыеЗатраты");
	СтруктураСоответствияТЧ.Вставить("ИнструментыИТехника", "Инструменты");
	
	
	// Формирование запроса
	СоответствиеНаимнованияТЧНомеруРезультатЗапроса = Новый Соответствие;
	НомерЗапроса = 0;
	
	Запрос = Новый Запрос;
	
	Для Каждого КлючИЗначение Из СтруктураСоответствияТЧ Цикл
		
		
		
		Если НомерЗапроса > 0 Тогда
			Запрос.Текст = Запрос.Текст + "
			|;
			|///////////////////////////////////////////////////////////////"
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|ВЫБРАТЬ *
		|ИЗ
		|	Справочник.торо_ТехнологическиеОперации." + КлючИЗначение.Ключ + " КАК торо_ТехнологическиеОперации" + КлючИЗначение.Ключ + "
		|ГДЕ
		|	торо_ТехнологическиеОперации" + КлючИЗначение.Ключ + ".Ссылка = &Ссылка";
		
		СоответствиеНаимнованияТЧНомеруРезультатЗапроса.Вставить(КлючИЗначение.Ключ, НомерЗапроса);
		НомерЗапроса = НомерЗапроса + 1;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Ссылка", Значение);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Для Каждого КлючИЗначение Из СтруктураСоответствияТЧ Цикл	
		
		НомерЗапроса = СоответствиеНаимнованияТЧНомеруРезультатЗапроса.Получить(КлючИЗначение.Ключ);
		
		ТЧ = РезультатЗапроса[НомерЗапроса].Выгрузить();
		
		Для Каждого СтрокаТЧ Из ТЧ Цикл
			
			НовСтрокаТЧ    = Объект[КлючИЗначение.Значение].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, СтрокаТЧ);
			НовСтрокаТЧ.ID = СтрокаДерева.ID;
			НовСтрокаТЧ.РемонтыОборудования_ID = СтрокаДерева.РемонтыОборудования_ID;
			
			Если КлючИЗначение.Ключ = "МатериальныеЗатраты" Тогда
				
				НовСтрокаТЧ.ЕдиницаИзмерения = СтрокаТЧ.Упаковка;
				НовСтрокаТЧ.Количество = СтрокаТЧ.КоличествоУпаковок;
				
				Коэффициент = НовСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
				
				Если Коэффициент = 0 Тогда
					Коэффициент = 1
				КонецЕсли;
				
				НовСтрокаТЧ.КоличествоЕдиниц = СтрокаТЧ.КоличествоУпаковок * Коэффициент;
			ИначеЕсли КлючИЗначение.Ключ = "ТрудоваеЗатраты"
				И Объект[КлючИЗначение.Значение].Колонки.Найти("ВремяРаботыТекст") Тогда 
				
				НовСтрокаТЧ.ВремяРаботыТекст = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(НовСтрокаТЧ.ВремяРаботы);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры 

// Определяет следующий статус документа относительно текущего по правилу
//
// Параметры:
//    УправлябщееПравило - ссылка на применяемое правило
//    ТекущийСтатусДокумента - статус документа.
//
// Возвращаемое значение:
//    следующий по правилу статус документа.
//
Функция ПолучитьСледующийСтатусНаОсновеПравила(УправляющееПравило, ТекущийСтатусДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_МатрицаПереходаСтатусовДокументов.СпособСогласования,
	|	торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус,
	|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус
	|ИЗ
	|	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|ГДЕ
	|	торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = &СпособСогласования
	|	И торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус = &ТекущийСтатус";
	
	Запрос.УстановитьПараметр("СпособСогласования", УправляющееПравило.Ссылка);
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатусДокумента);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	
		Возврат Неопределено;
	
	КонецЕсли; 
	
	СписокСтатусов = Новый СписокЗначений;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		СписокСтатусов.Добавить(Выборка.СледующийСтатус);
	
	КонецЦикла;
	
	Возврат СписокСтатусов;
	
КонецФункции  // ПолучитьСледующийСтатусНаОсновеПравила

// Функция получает из запроса по регистру накопления торо_УчетЭтаповРаботОстатки проценты невыполненных работ
// по элементам справочника торо_СоставРемонтныхРабот, которые выбранны в заявке
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт.
//  Возвращаемое значение:
//   выборка из запроса с элементами справочника торо_СоставРемонтныхРабот и процентом невыполнения их по заявке.
Функция СоздатьВыборкуРаботВЗаявкеСПроцентомРабот(Знач Заявка) Экспорт
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	торо_СоставРемонтныхРабот.Ссылка,
		|	ЕСТЬNULL(торо_УчетЭтаповРаботОстатки.ПроцентНевыполненныхРаботОстаток, 0) КАК ПроцентНевыполненныхРаботОстаток
		|ИЗ
		|	Справочник.торо_СоставРемонтныхРабот КАК торо_СоставРемонтныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_УчетЭтаповРабот.Остатки(, ЗаявкаНаРемонт = &Заявка) КАК торо_УчетЭтаповРаботОстатки
		|		ПО торо_СоставРемонтныхРабот.Заявка = торо_УчетЭтаповРаботОстатки.ЗаявкаНаРемонт
		|			И торо_СоставРемонтныхРабот.УникальныйИдентификатор = торо_УчетЭтаповРаботОстатки.УникальныйИдентификатор
		|ГДЕ
		|	торо_СоставРемонтныхРабот.Заявка = &Заявка
		|");
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции //СоздатьВыборкуРаботВЗаявкеСПроцентомРабот()

// Функция получает из запроса по регистру накопления торо_УчетЭтаповРаботОстатки проценты невыполненных работ
// по операции.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   УникальныйИдентификатор - уникальный идентификатор операции;
//	 ДокументОбъект - документ, который делает движения по регистру накопления торо_УчетЭтаповРаботОстатки.
//  Возвращаемое значение;
//   процент невыполнения.
Функция ПолучитьПроцентРаботНаПозициюДокумента(Знач Заявка, Знач УникальныйИдентификатор, Знач ДокументОбъект) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(торо_УчетЭтаповРаботОстатки.ПроцентНевыполненныхРаботОстаток, 100) КАК ПроцентНевыполненныхРаботОстаток
	                      |ИЗ
	                      |	РегистрНакопления.торо_УчетЭтаповРабот.Остатки(
	                      |		&Период, ЗаявкаНаРемонт = &Заявка И УникальныйИдентификатор = &УникальныйИдентификатор) КАК торо_УчетЭтаповРаботОстатки
	                      |");
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ПроцентНевыполненныхРаботОстаток;
	КонецЕсли;
	Возврат 0;
КонецФункции //ПолучитьПроцентРаботНаПозициюДокумента()

// Функция получает из запроса по регистру накопления торо_УчетЭтаповРаботОстатки стоимость работ
// по операции.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   УникальныйИдентификатор - уникальный идентификатор операции;
//	 ДокументОбъект - документ, который делает движения по регистру накопления торо_УчетЭтаповРаботОстатки.
//  Возвращаемое значение;
//   стоимость.
Функция ПолучитьСуммуПоРаботеНаПозициюДокумента(Знач Заявка, Знач УникальныйИдентификатор, Знач ДокументОбъект) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	торо_УчетЭтаповРабот.Сумма КАК Стоимость,
		|	торо_УчетЭтаповРабот.ВидДвижения КАК ВидДвижения,
		|	торо_УчетЭтаповРабот.Период КАК Период,
		|	торо_УчетЭтаповРабот.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.торо_УчетЭтаповРабот КАК торо_УчетЭтаповРабот
		|ГДЕ
		|	ЗаявкаНаРемонт = &Заявка И УникальныйИдентификатор = &УникальныйИдентификатор
		|");
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	
	Стоимость = 0;
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.ВидДвижения = ВидДвиженияНакопления.Расход 
			И ДокументОбъект.МоментВремени().Сравнить(Новый МоментВремени(Результат.Период, Результат.Регистратор)) = 1 Тогда
			Стоимость = Стоимость + Результат.Стоимость;
		КонецЕсли;
	КонецЦикла;
	Возврат Стоимость;
КонецФункции  //ПолучитьСуммуПоРаботеНаПозициюДокумента()

// Функция получает из запроса по регистру накопления торо_УчетЭтаповРаботОстатки признак выполнения 
// заявки.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   УникальныйИдентификатор - уникальный идентификатор операции;
//  Возвращаемое значение;
//   булево - признак выполнения заявки.
Функция НеобходимаПриходнаяЗаписьВУчетеЭтаповРабот(Знач Заявка, Знач УникальныйИдентификатор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	торо_УчетЭтаповРабот.ЗаявкаНаРемонт
		|ИЗ
		|	РегистрНакопления.торо_УчетЭтаповРабот КАК торо_УчетЭтаповРабот
		|ГДЕ
		|	торо_УчетЭтаповРабот.ЗаявкаНаРемонт = &Заявка
		|	И торо_УчетЭтаповРабот.ВидДвижения = &ВидДвижения
		|	И торо_УчетЭтаповРабот.ПроцентНевыполненныхРабот = 100
		|	И торо_УчетЭтаповРабот.УникальныйИдентификатор = &УникальныйИдентификатор
		|";
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //НеобходимаПриходнаяЗаписьВУчетеЭтаповРабот()

// Функция предназначена для проверки закрытия операции документом торо_АктОВыполненииЭтапаРабот при проведении
// другого документа торо_АктОВыполненииЭтапаРабот.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт, в котором была установлены операция;
//   УникальныйИдентификатор - уникальный идентификатор операции;
//   Документ - ссылка на текущий документ торо_АктОВыполненииЭтапаРабот.
//  Возвращаемое значение:
//   Булево - признак закрытия операции другим документом торо_АктОВыполненииЭтапаРабот.
Функция ЭтаОперацияСодержитсяВАктеОВыполненииЭтапаРаботНаПозициюДокумента(Знач Заявка, Знач УникальныйИдентификатор, Знач Документ) Экспорт
	
	МоментПроверки = ?(ЗначениеЗаполнено(Документ), Документ.МоментВремени(), Новый МоментВремени(ТекущаяДата()));

	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	торо_ОперацииАктовОВыполненииЭтаповРабот.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрСведений.торо_ОперацииАктовОВыполненииЭтаповРабот КАК торо_ОперацииАктовОВыполненииЭтаповРабот
		|ГДЕ
		|	торо_ОперацииАктовОВыполненииЭтаповРабот.ЗаявкаНаРемонт = &Заявка
		|	И торо_ОперацииАктовОВыполненииЭтаповРабот.УникальныйИдентификатор = &УникальныйИдентификатор
		|	И торо_ОперацииАктовОВыполненииЭтаповРабот.Регистратор <> &Регистратор
		|"
	);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.МоментВремени().Сравнить(МоментПроверки) = 1 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции // ЭтаОперацияСодержитсяВАктеОВыполненииЭтапаРаботНаПозициюДокумента()

// Функция предназаначена для получения из запроса документа торо_АктОВыполненииЭтапаРабот, которым осуществлялись
// движения по текущей операции по регистру сведений торо_ОперацииАктовОВыполненииЭтаповРабот.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   УникальныйИдентификатор - уникальный идентификатор текущей операции;
//   Документ - текущий документ торо_АктОВыполненииЭтапаРабот, движения которого не надо учитывать .
//  Возвращаемое значение:
//   ссылка на документ торо_АктОВыполненииЭтапаРабот.
Функция НайтиАктОВыполненииЭтапаРаботНаПозициюДокументаПоОперации(Знач Заявка, Знач УникальныйИдентификатор, Знач Документ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	  |	ВЫРАЗИТЬ(торо_ОперацииАктовОВыполненииЭтаповРабот.Регистратор КАК Документ.торо_АктОВыполненииЭтапаРабот) КАК Ссылка
	  |ИЗ
	  |	РегистрСведений.торо_ОперацииАктовОВыполненииЭтаповРабот КАК торо_ОперацииАктовОВыполненииЭтаповРабот
	  |ГДЕ
	  |	торо_ОперацииАктовОВыполненииЭтаповРабот.ЗаявкаНаРемонт = &Заявка
	  |	И торо_ОперацииАктовОВыполненииЭтаповРабот.УникальныйИдентификатор = &УникальныйИдентификатор
	  |	И торо_ОперацииАктовОВыполненииЭтаповРабот.Регистратор <> &Регистратор
	  |	И торо_ОперацииАктовОВыполненииЭтаповРабот.Регистратор ССЫЛКА Документ.торо_АктОВыполненииЭтапаРабот"
	);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.МоментВремени().Сравнить(Документ.МоментВремени()) = 1 Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.торо_АктОВыполненииЭтапаРабот.ПустаяСсылка();
КонецФункции //НайтиАктОВыполненииЭтапаРаботНаПозициюДокументаПоОперации()

// Функция предназаначена для получения из запроса документа
// торо_НарядНаВыполнениеРемонтныхРабот, которым осуществлялись
// движения по текущей операции по регистру сведений торо_ОперацииНарядов.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   УникальныйИдентификатор - уникальный идентификатор текущей операции;
//   ИсключаемыйНаряд - текущий документ торо_НарядНаВыполнениеРемонтныхРабот, движения которого не надо учитывать.
//  Возвращаемое значение:
//   ссылка на документ торо_НарядНаВыполнениеРемонтныхРабот.
Функция НайтиНарядПоОперации(Знач ЗаявкаНаРемонт, Знач УникальныйИдентификатор, Знач ИсключаемыйНаряд) Экспорт
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫРАЗИТЬ(торо_ОперацииНарядов.Регистратор КАК Документ.торо_НарядНаВыполнениеРемонтныхРабот) КАК Наряд
		|ИЗ
		|	РегистрСведений.торо_ОперацииНарядов КАК торо_ОперацииНарядов
		|ГДЕ
		|	торо_ОперацииНарядов.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
		|	И торо_ОперацииНарядов.УникальныйИдентификатор = &УникальныйИдентификатор
		|	И торо_ОперацииНарядов.ЗаявкаНаРемонт = &ЗаявкаНаРемонт
		|	И ВЫРАЗИТЬ(торо_ОперацииНарядов.Регистратор КАК Документ.торо_НарядНаВыполнениеРемонтныхРабот) <> &ИсключаемыйНаряд
		|");
	Запрос.УстановитьПараметр("ЗаявкаНаРемонт", ЗаявкаНаРемонт);
	Запрос.УстановитьПараметр("ИсключаемыйНаряд", ИсключаемыйНаряд);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", УникальныйИдентификатор);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Наряд;
	КонецЕсли;
	Возврат Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка();
КонецФункции //НайтиНарядПоОперации()

// Функция проверяет занятость исполнителя на дату текущей заявки
//  Параметры:
//   Исполнитель - текущей исполнитель, справочник ФизическиеЛица;
//   Документ - текущая заявка, ссылка на документ торо_ЗаявкаНаРемонт.
//  Возвращаемое значение:
//   булево - признак занятости исполнителя в заявке.
Функция ЭтотИсполнительЗанятНаПозициюДокумента(Знач Исполнитель, Знач Документ) Экспорт
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
	    |	торо_ЗанятостьИсполнителейОстатки.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	    |ИЗ
	    |	РегистрНакопления.торо_ЗанятостьИсполнителей.Остатки(&Период, Исполнитель = &Исполнитель) КАК торо_ЗанятостьИсполнителейОстатки
	    |"
	);
	Запрос.УстановитьПараметр("Период", Документ.МоментВремени());
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции //ЭтотИсполнительЗанятНаПозициюДокумента()

// Функция определяет наличие связанного с заявкой проведенного документа торо_АктОВыполненииРабот
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   ИсключаемыйДокумент - документ, который не надо проверять.
//   ТолькоПроведенный - булево, признак проведения документа.
//  Возвращаемое значение:
//   булево - признак наличия связанного с заявкой проведенного документа торо_АктОВыполненииРабот.
Функция ПолучитьАктОВыполненииРемонтныхРаботСвязанныйСЗаявкой(Знач Заявка, Знач ИсключаемыйДокумент = Неопределено, Знач ТолькоПроведенный) Экспорт
	Возврат ПолучитьСвязанныйСЗаявкойДокумент(Заявка, "торо_АктОВыполненииЭтапаРабот", ИсключаемыйДокумент, ТолькоПроведенный);
КонецФункции //ПолучитьАктОВыполненииРемонтныхРаботСвязанныйСЗаявкой()

// Функция определяет наличие связанного с заявкой документа торо_НарядНаВыполнениеРемонтныхРабот
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//  Возвращаемое значение:
//   булево - признак наличия связанного с заявкой документа торо_НарядНаВыполнениеРемонтныхРабот.
Функция ЕстьНарядНаВыполнениеРемонтныхРаботСвязанныйСЗаявкой(Знач Заявка) Экспорт
	Возврат ЕстьСвязанныйСЗаявкойДокумент(Заявка, "торо_НарядНаВыполнениеРемонтныхРабот");
КонецФункции //ЕстьНарядНаВыполнениеРемонтныхРаботСвязанныйСЗаявкой()

// Функция определяет наличие связанного с заявкой документа торо_АктОВыполненииЭтапаРабот
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//  Возвращаемое значение:
//   булево - признак наличия связанного с заявкой документа торо_АктОВыполненииЭтапаРабот.
Функция ЕстьАктОВыполненииЭтапаРемонтныхРаботСвязанныйСЗаявкой(Знач Заявка) Экспорт
	Возврат ЕстьСвязанныйСЗаявкойДокумент(Заявка, "торо_АктОВыполненииЭтапаРабот");
КонецФункции //ЕстьАктОВыполненииЭтапаРемонтныхРаботСвязанныйСЗаявкой()

// Функция проверяет наличие проведенного документа торо_АктОВыполненииРабот, созданный после текущего документа
// торо_АктОВыполненииРабот.
//  Параметры:
//   Акт - текущий документ торо_АктОВыполненииРабот.
//  Возвращаемое значение:
//   булево - признак наличия документа.
Функция ЕстьАктОВыполненииРемонтныхРаботСозданныйПослеАкта(Знач Акт) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	торо_АктОВыполненииЭтапаРабот.ЗаявкаНаРемонт
	               |ИЗ
	               |	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРабот КАК торо_АктОВыполненииРабот
	               |		ПО торо_АктОВыполненииЭтапаРабот.МоментВремени < торо_АктОВыполненииРабот.МоментВремени
	               |			И торо_АктОВыполненииЭтапаРабот.ЗаявкаНаРемонт = торо_АктОВыполненииРабот.ЗаявкаНаРемонт
	               |ГДЕ
	               |	торо_АктОВыполненииЭтапаРабот.Ссылка = &Акт
	               |	И торо_АктОВыполненииРабот.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Акт", Акт);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции //ЕстьАктОВыполненииРемонтныхРаботСозданныйПослеАкта()

// Функция возвращает список документов торо_НарядНаВыполнениеРемонтныхРабот, созданных на основании заявки и 
// момент времени которых меньше текущего документа наряда.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт, на основании которой сделан текущий документ;
//   Документ - текущий документ торо_НарядНаВыполнениеРемонтныхРабот.
//  Возвращаемое значение:
//   список значений с ссылками на документы торо_НарядНаВыполнениеРемонтныхРабот.
Функция СоздатьСписокНарядовЗаявкиНаПозициюДокумента(Знач Заявка, Знач Документ) Экспорт
	Список = Новый СписокЗначений;	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРабот
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРабот.ЗаявкаНаРемонт = &Заявка
		|");
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.МоментВремени().Сравнить(Документ.МоментВремени()) = -1
			И Выборка.Ссылка <> Документ Тогда
			Список.Добавить(Выборка.Ссылка);	
		КонецЕсли;
	КонецЦикла;
	Возврат Список;
КонецФункции //СоздатьСписокНарядовЗаявкиНаПозициюДокумента()

// Функция возвращает список документов торо_АктОВыполненииЭтапаРабот, созданных на основании заявки и 
// момент времени которых меньше текущего документа акта.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт, на основании которой сделан текущий документ;
//   Документ - текущий документ торо_АктОВыполненииЭтапаРабот.
//  Возвращаемое значение:
//   список значений с ссылками на документы торо_АктОВыполненииЭтапаРабот. 
Функция СоздатьСписокАктовОВыполненииРаботЗаявкиНаПозициюДокумента(Знач Заявка, Знач Документ) Экспорт
	Список = Новый СписокЗначений;	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРабот.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРабот.НарядНаРемонт.ЗаявкаНаРемонт = &Заявка
		|");
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.МоментВремени().Сравнить(Документ.МоментВремени()) = -1
			И Выборка.Ссылка <> Документ Тогда
			Список.Добавить(Выборка.Ссылка);	
		КонецЕсли;
	КонецЦикла;
	Возврат Список;
КонецФункции //СоздатьСписокАктовОВыполненииРаботЗаявкиНаПозициюДокумента()

// Функция возвращает список исполнителей текущей заявки
//  Параметры:
//   ЗаявкаНаРемонт - текущая заявка, ссылка на документ торо_ЗаявкаНаРемонт.
//  Возвращаемое значение:
//   список значений ссылками на элементы справочника ФизическиеЛица.
Функция СоздатьСписокИсполнителейЗаявки(Знач ЗаявкаНаРемонт) Экспорт
	
	Результат = Новый СписокЗначений;	
	
	Для Каждого Стр Из ЗаявкаНаРемонт.ИсполнителиРемонтов Цикл
		Результат.Добавить(Стр.Исполнитель);	
	КонецЦикла;
	Возврат Результат;
	
КонецФункции //СоздатьСписокИсполнителейЗаявки()

// Процедура выполняет заполнение затрат по данным нормативов.
//
Процедура ЗаполнитьЗатратыПоТиповым(ДокументОбъект, СтрокаДерева, ID) Экспорт
	
	РемонтнаяРабота = СтрокаДерева.Родитель.РемонтнаяРабота;
	
	Если РемонтнаяРабота = Неопределено Или ID = "" Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	СтруктураТЧ = Новый Структура();
	СтруктураТЧ.Вставить("МатериальныеЗатраты", "МатериальныеЗатраты");
	СтруктураТЧ.Вставить("ТрудовыеЗатраты", "ТрудовыеЗатраты");
	СтруктураТЧ.Вставить("ИнструментыИТехника", "Инструменты");
	СтруктураТЧ.Вставить("МерыБезопасности", "МерыБезопасности");
	
	Для Каждого КлючИЗначение Из СтруктураТЧ Цикл
		
		ТабЧастьДокумента = ДокументОбъект[КлючИЗначение.Значение];
		МассивСтрок   = РемонтнаяРабота[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID", ID));
		
	    Для Каждого ЭлМассива Из МассивСтрок Цикл
		
			НовСтрокаТЧ = ТабЧастьДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, ЭлМассива); 
			НовСтрокаТЧ.ID = СтрокаДерева.ID;
			НовСтрокаТЧ.РемонтыОборудования_ID = СтрокаДерева.РемонтыОборудования_ID;
	 
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

// Функция возвращает признак наличия сформированных заявок по таблице ID.
//
// Параметры
//  ТаблицаID  - ТаблицаЗначений - содержит ID для проверки.
//
// Возвращаемое значение:
//   Булево   - признак наличия сформированных заявок.
//
Функция ЕстьЗаявкаПоТаблицеID(ТаблицаID, Проверка=Ложь, ТолькоПроведенные=Ложь) Экспорт
	
	ЕстьЗаявки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица_ID.ID
	               |ПОМЕСТИТЬ ТаблицаID
	               |ИЗ
	               |	&Таблица_ID КАК Таблица_ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ЗаявкаНаРемонт.Представление
	               |ИЗ
	               |	ТаблицаID КАК ТаблицаID
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	               |		ПО ТаблицаID.ID = торо_ЗаявкаНаРемонт.ID_СтрокиДокументаОснования
	               |ГДЕ
	               |	торо_ЗаявкаНаРемонт.ПометкаУдаления = ЛОЖЬ"
	+?(ТолькоПроведенные," И торо_ЗаявкаНаРемонт.Проведен","");
	
	Запрос.УстановитьПараметр("Таблица_ID", ТаблицаID);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		ЕстьЗаявки = Истина;
		
		Если не Проверка Тогда 
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'По работам плана-графика ППР были сформированы документы!'"), СтатусСообщения.Важное);
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Выборка.Представление);
				
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ЕстьЗаявки;
	
КонецФункции // ЕстьЗаявкаПоСтрокеПланаГрафикаППР()

// Функция получает из запроса документ по заданным параметрам.
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   ИмяТипаДокумента - тип документа;
//   ИсключаемыйДокумент - документ, который не надо выбирать;
//   ТолькоПроведенный - признак проведения документа
//  Возвращаемое значение;
//   ссылка на документ.
Функция ПолучитьСвязанныйСЗаявкойДокумент(Знач Заявка, Знач ИмяТипаДокумента, Знач ИсключаемыйДокумент = Неопределено, Знач ТолькоПроведенный = Истина)
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	" + ИмяТипаДокумента + ".Ссылка
		|ИЗ
		|	Документ." + ИмяТипаДокумента + ".ДокументыОснования КАК " + ИмяТипаДокумента + "
		|ГДЕ
		|	" + ИмяТипаДокумента + ".ДокументОснование = &Заявка"
		+ ?(ТолькоПроведенный, "	И " + ИмяТипаДокумента + ".Проведен = ИСТИНА", "")
		+ "	И " + ИмяТипаДокумента + ".Ссылка <> &ИсключаемыйДокумент"
	);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ИсключаемыйДокумент", ИсключаемыйДокумент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции //ПолучитьСвязанныйСЗаявкойДокумент()

// Функция определяет наличие связанного с заявкой документа
//  Параметры:
//   Заявка - ссылка на документ торо_ЗаявкаНаРемонт;
//   ИмяТипаДокумента - тип документа, связь с заявкой которого определяется;
//   ИсключаемыйДокумент - документ, который не надо проверять.
//  Возвращаемое значение:
//   булево - признак наличия связанного с заявкой документа.
Функция ЕстьСвязанныйСЗаявкойДокумент(Знач Заявка, Знач ИмяТипаДокумента, Знач ИсключаемыйДокумент = Неопределено)
	Возврат ПолучитьСвязанныйСЗаявкойДокумент(Заявка, ИмяТипаДокумента, ИсключаемыйДокумент) <> Неопределено;
КонецФункции //ЕстьСвязанныйСЗаявкойДокумент()

#КонецОбласти
